'''

정적 웹사이트 = 움직임이 없는, 고정된 웹사이트

동적 웹사이트 = 움직임이 많은, 다이나믹한 웹사이트


브라우저 렌더링

정적 웹사이트 : 주는 대로 그림

html 문서의 경우는 html -> body -> button -> img-> div 등등 있을때 브라우저는 랜더링해줍니다.
정적은 문서 그대로 그려주는것입니다.
html, css를 실행한느것

동적인 경우에는 스크롤을 내려볼때 bye라는것이 뜹니다. html 볼때에는 없던것이 나온것이다.
즉 자바스크립트를 실행하는거라고 생각하면 이해하기 쉽다.


정적인 웹사이트는 정적인 랜더링을 한다.
 - 데이터가 한번에 담겨져 온다.
 - 중복된 데이터가 잦다.
 - 드물게 통신한다.
 - 역사가 오래되어 안정적이다.
sso란?



동적인 웹사이트 원리 및 특징
  - 사이트가 깜빡이지 않는다.
  - 화면이 한번에 다 로딩되지 않는다. (DOM 생성)
  - javascript 가 필수이다.


서버 <-> 클라이언트의 흐름 및 특징

 - 데이터가 따로 따로 여러군데에서 온다.
 - 서버와 자주 통신한다.
 - 디자인이 화려하다.
 - 기능이 많고 사용성어 편리하다.






'''